# Q1

In [4]:
import pandas as pd

In [5]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [10]:
obj1 = pd.Series(sdata) # keys as index
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas'] # custom index
obj2 = pd.Series(sdata, index=states) # adds custom index, which negates Utah
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
obj3 = pd.isnull(obj2) # mask
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
obj3['California'] # true

True

In [17]:
obj2['California'] == None # false - NaN (numerical null) is not None (object null)

False

In [24]:
x = obj2['California'] # NaN is not equal to itself unless using math.isnan()
obj2['California'] != x

nan

True

In [25]:
import math
math.isnan(obj2['California'])

True

# Q2

In [38]:
# key = rank, value = name

d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)

# Which of the following can be used to extract rows with student ranks that are lower than or equal to 3?

S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

# Q3

In [46]:
# Suppose we have a DataFrame named df. We want to change the original DataFrame df in a way that all the column 
# names are cast to upper case. Which of the following expressions is incorrect to perform the same?

df = pd.read_csv("Assignment/olympics.csv", header=1)
df.columns

Index(['Unnamed: 0', '№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter',
       '01 !.1', '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2',
       '03 !.2', 'Combined total'],
      dtype='object')

In [48]:
df.rename(mapper = lambda x: x.upper(), axis = 1)

,UNNAMED: 0,№ SUMMER,01 !,02 !,03 !,TOTAL,№ WINTER,01 !.1,02 !.1,03 !.1,TOTAL.1,№ GAMES,01 !.2,02 !.2,03 !.2,COMBINED TOTAL
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
142,Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
143,Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
144,Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
145,Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
146,Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

# Q4

In [87]:
df = pd.read_csv("Assignment/Admission_Predict.csv")
df

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...,...
395,396,324,110,3,3.5,3.5,9.04,1,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [96]:
df = df[df['Serial No.'] < 6]
df

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [102]:
q4_df = df[['Serial No.', 'GRE Score', 'TOEFL Score']]

   Serial No.  GRE Score  TOEFL Score
0           1        337          118
1           2        324          107
2           3        316          104
3           4        322          110
4           5        314          103